"""
    Вводится число от 1 до 999
    (если введено не число либо число вне диапазона - вывести сообщение)
    1. Найти сумму цифр числа.
    2. Вывести на экран, порядок, в котором расположены цифры числа
        (возростание/убывание/в разброс(равны))
"""
try:
    a = int(input("Введіть число від 1 до 999: "))
    if a < 1:
        print("Число менше 1")
    elif a > 999:
        print("Число більше 999")
    elif a == 0:
        print("Число дорівнює 0")
    else:
        d1 = a // 100
        d2 = a // 10 % 10
        d3 = a % 10 
        print(d1,d2,d3)
        print(d1 + d2 + d3)
        if d1 < d2 and d2 < d3:
            print("Зростання")
        if d1 > d2 and d2 < d3:
            print("Спадання")
        if d1 == d2 and d2 == d3:
            print("Рівні")
        else:
            print("Змішані")
except ValueError:
    print("Введено не коректні дані або не число")

