"""
    Дан список целых чисел my_list.

    1.
    Поменять местами 1 и последний элемент списка.

    2.
    Создать новый список состоящий из элементов my_list, при этом заменив
    отрицательные числа на -1,
    положительные - на число 1, ноль оставить без изменений.
    Вывести 2 списка.

    3.
    Разделить исходный список на два списка
    с положительными и отрицательными числами.
    Вывести максимальное и минимальное значение каждого списка.

    4.
    Создайте список,
    в котором содержатся только нечетные числа из списка my_list

    5.
    Создайте список,
    в котором содержатся квадраты отрицательных чисел из списка my_list
"""

my_list = [1, -2, 16, -13, 20, 0, 3, 77, 225, -42, -10, 21, 523]
