"""
    (1-3 пункты были решены на уроке, необходимо привести все к нужному виду)
    При запуске программы выбор:
    1. Найти количество четных и нечетных цифр числа.
    2. Найти факториал числа.
    3. Вывести последовательность чисел в степени до предела.
    4. Выход.
    * после выполнения пунктов 1-3 попадаем обратно в меню.
"""
while True:
    print(''' 
Меню:
1. Найти кількість парних і не парних цифр числа.
2. Найти факторіал числа.
3. Вивести послідовність числ до максимального.
4. Вихід''')

    a = int(input("Зробіть вибір і нажміть Enter: "))

# 1. Парні і не парні числа
    if a == 1:
        i = int(input("Введіть число: "))
        even = 0
        odd = 0
        while i > 0:
            last_digit = i % 10

            if last_digit % 2 == 0:
                even += 1
            else:
                odd += 1
            i //= 10
        print("Парних: ", even)
        print("Не парних: ", odd)

# 2. Факторіал числа
    elif a == 2:
        i = int(input("Введіть число: "))
        f = 1
        while i > 1:
            f *= i
            i -= 1
        print("Факторіал: ", f)

# 3. Послідовність чсел в ступені до максимального
    elif a == 3:
        p = int(input("Введіть ступінь: "))
        limit = int(input("Ліміт: "))
        g = 1
        while (result := g ** p) < limit:
            print(g, "в ступіні", p, ":" , result)
            g += 1

# 4. Вихід

    elif a == 4:
        print("До побачення")
        break

    else:
        print("Не вірно введені дані")
            
    if input("Continue? (Y/n) ") == "n":
        break    
